#version: 0.2
T H
S T
Ġ S
Ġ E
N O
R TH
Ġ NO
ĠNO RTH
E ST
W EST
Ġ WEST
O U
ĠS OU
ĠSOU TH
A ST
ĠE AST
Ġ i
Ġ j
Ġ f
Ġ t
Ġ v
Ġ k
Ġ l
Ġ o
Ġ q
Ġ h
Ġ r
Ġ g
Ġ x
Ġ n
Ġ u
Ġ y
Ġ z
Ġ c
Ġ a
Ġ m
Ġ e
Ġ p
Ġ w
Ġ d
Ġ b
Ġ s
A R
A TH
D E
M O
P ATH
o r
Ġ ST
Ġ PATH
AR T
MO DE
ĠST ART
F or
N D
a g
e s
h or
i n
t es
Ġ For
ĠS hor
ĠE ND
ag in
tes t
ĠFor agin
ĠShor test
ĠForagin g
Ġa r
Ġl u
Ġf e
Ġr r
Ġq y
Ġi m
Ġl p
Ġj g
Ġm o
Ġx s
Ġp b
Ġk p
Ġq e
Ġz e
Ġh m
Ġf g
Ġn w
Ġw v
Ġe e
Ġm c
Ġk v
Ġs x
Ġf k
Ġh x
Ġp k
Ġo a
Ġw x
Ġy u
Ġn b
Ġs h
Ġr i
Ġn m
Ġj p
Ġt q
Ġd l
Ġj j
Ġi u
Ġb s
Ġc z
Ġr k
Ġv j
Ġo d
Ġw m
Ġg b
Ġn u
Ġd j
Ġk b
Ġe y
Ġp c
Ġq d
Ġy n
Ġc l
Ġl o
Ġr y
Ġt f
Ġl z
Ġx w
Ġn e
Ġb t
Ġi v
Ġg c
Ġz l
Ġu i
Ġk f
Ġi r
Ġr a
Ġz s
Ġd h
Ġa o
Ġu f
Ġz m
Ġc t
Ġf u
Ġv a
Ġn t
Ġi a
Ġt c
Ġj f
Ġy h
Ġj b
Ġk s
Ġf p
Ġo m
Ġu n
Ġl t
Ġq s
Ġv c
Ġj n
Ġx b
Ġo e
Ġt a
Ġx u
Ġh z
Ġd w
Ġy v
Ġk h
Ġo p
Ġv f
Ġc r
Ġr t
Ġv m
Ġg o
Ġa e
Ġd k
Ġr p
Ġj v
Ġz x
Ġu w
Ġo z
Ġt g
Ġh a
Ġq c
Ġj h
Ġb k
Ġz p
Ġf t
Ġc s
Ġk a
Ġv t
Ġi w
Ġq m
Ġu g
Ġk m
Ġb b
Ġs g
Ġz j
Ġe f
Ġr h
Ġq h
Ġy p
Ġb l
Ġi g
Ġq t
Ġi p
Ġm a
Ġd m
Ġo g
Ġw f
Ġi z
Ġa b
Ġi i
Ġv n
Ġo w
Ġo q
Ġv q
Ġw u
Ġl b
Ġp p
Ġj k
Ġt s
Ġv d
Ġh k
Ġl v
Ġf d
Ġu z
Ġb u
Ġx j
Ġe w
Ġr e
Ġw z
Ġc k
Ġx a
Ġn z
Ġu t
Ġe i
Ġt h
Ġl e
Ġl x
Ġk o
Ġg d
Ġm v
Ġd q
Ġg t
Ġb a
Ġj t
Ġw l
Ġf h
Ġc a
Ġy o
Ġk n
Ġz i
Ġt n
Ġg n
Ġr g
Ġp v
Ġy x
Ġf w
Ġf x
Ġi y
Ġo s
Ġi s
Ġt x
Ġn i
Ġj r
Ġd u
Ġa h
Ġp h
Ġj w
Ġk c
Ġg u
Ġq v
Ġq l
Ġm e
Ġn v
Ġu s
Ġh n
Ġa s
Ġp z
Ġi n
Ġg j
Ġv r
Ġx f
Ġv u
Ġb o
Ġz z
Ġk x
Ġe r
Ġu j
Ġk g
Ġm l
Ġa t
Ġh b
Ġx m
Ġq j
Ġs d
Ġe s
Ġs r
Ġh j
Ġs a
Ġa a
Ġt j
Ġv l
Ġl c
Ġk t
Ġz k
Ġl l
Ġn s
Ġm k
Ġu b
Ġa x
Ġq a
Ġs o
Ġg w
Ġq i
Ġy i
Ġe b
Ġx t
Ġl q
Ġt v
Ġd z
Ġz q
Ġu d
Ġe u
Ġl r
Ġh w
Ġw a
Ġt e
Ġv s
Ġa m
Ġb r
Ġb v
Ġy r
Ġr l
Ġu e
Ġj y
Ġo f
Ġy b
Ġd x
Ġh g
Ġi h
Ġg g
Ġm t
Ġf r
Ġt d
Ġw k
Ġx k
Ġi t
Ġw b
Ġi b
Ġa d
Ġm s
Ġc j
Ġr w
Ġd f
Ġn j
Ġp s
Ġo h
Ġg i
Ġs p
Ġt k
Ġo k
Ġv g
Ġf v
Ġj q
Ġv z
Ġm w
Ġc h
Ġs k
Ġf y
Ġp l
Ġi d
Ġy c
Ġm n
Ġh e
Ġy s
Ġh r
Ġg h
Ġu l
Ġs f
Ġx z
Ġe j
Ġt u
Ġw y
Ġy w
Ġu h
Ġq k
Ġh q
Ġp r
Ġw d
Ġs s
Ġp q
Ġt w
Ġg m
Ġp u
Ġg p
Ġi o
Ġm h
Ġf a
Ġi f
Ġg a
Ġs t
Ġm u
Ġb d
Ġr s
Ġc i
Ġf z
Ġt o
Ġf c
Ġu m
Ġc x
Ġe g
Ġe v
Ġa p
Ġc c
Ġd d
Ġt z
Ġr n
Ġi k
Ġz w
Ġy g
Ġx p
Ġh u
Ġo v
Ġv w
Ġf m
Ġb e
Ġy y
Ġv h
Ġv i
Ġy z
Ġx d
Ġk i
Ġv e
Ġx q
Ġf n
Ġk j
Ġn n
Ġf f
Ġo y
Ġw q
Ġl a
Ġs b
Ġx c
Ġr x
Ġz h
Ġt t
Ġz a
Ġg q
Ġg r
Ġh f
Ġz b
Ġx r
Ġi x
Ġh p
Ġv k
Ġb c
Ġk e
Ġl i
Ġq u
Ġt l
Ġt m
Ġf s
Ġy d
Ġj c
Ġn c
Ġs i
Ġd c
Ġp x
Ġh y
Ġc g
Ġg v
Ġp g
Ġx e
Ġs y
Ġw s
Ġj d
Ġd y
Ġg x
Ġs e
Ġg l
Ġq f
Ġv x
Ġb y
Ġp o
Ġc o
Ġa g
Ġy m
Ġo j
Ġb g
Ġe k
Ġs n
Ġg k
Ġy l
Ġb x
Ġj i
Ġk u
Ġm m
Ġc v
Ġn o
Ġu p
Ġg z
Ġo x
Ġm d
Ġd s
Ġo o
Ġa n
Ġc u
Ġc y
Ġe d
Ġh o
Ġm z
Ġj e
Ġp w
Ġk l
Ġi c
Ġc q
Ġp e
Ġi q
Ġu r
Ġa y
Ġo l
Ġd e
Ġm r
Ġo i
Ġt b
Ġz f
Ġl m
Ġj u
Ġf i
Ġh c
Ġe z
Ġa w
Ġx x
Ġa l
Ġe m
Ġl h
Ġg y
Ġd p
Ġc m
Ġl y
Ġp f
Ġi e
Ġn q
Ġx g
Ġe c
Ġp d
Ġw g
Ġq b
Ġj m
Ġf q
Ġf o
Ġu q
Ġc w
Ġq g
Ġh h
Ġa q
Ġk w
Ġh s
Ġx o
Ġm p
Ġp t
Ġe n
Ġe l
Ġz v
Ġc b
Ġw w
Ġx y
Ġg e
Ġe o
Ġw r
Ġu y
Ġc e
Ġf j
Ġn h
Ġe q
Ġn y
Ġy k
Ġh d
Ġq p
Ġr j
Ġz r
Ġj x
Ġy j
Ġa i
Ġu c
Ġw n
Ġr c
Ġs c
Ġm y
Ġw t
Ġv p
Ġj z
Ġp j
Ġa f
Ġr u
Ġt y
Ġx n
Ġt p
Ġe x
Ġl k
Ġd b
Ġv b
Ġr v
Ġx i
Ġi j
Ġz n
Ġn x
Ġe a
Ġe p
Ġj o
Ġn k
Ġd t
Ġz y
Ġs w
Ġn a
Ġd v
Ġn l
Ġx l
Ġr q
Ġa u
Ġa j
Ġs m
Ġb j
Ġo c
Ġm f
Ġh t
Ġm i
Ġw c
Ġd i
Ġm x
Ġj a
Ġh i
Ġq r
Ġj l
Ġy a
Ġz u
Ġu k
Ġz g
Ġu v
Ġl j
Ġw e
Ġl w
Ġc p
Ġa v
Ġr m
Ġo u
Ġu x
Ġn f
Ġm q
Ġb w
Ġm j
Ġl s
Ġr d
Ġy t
Ġc d
Ġo r
Ġb f
Ġt i
Ġq q
Ġw p
Ġh l
Ġz o
Ġw h
Ġv v
Ġj s
Ġq x
Ġc n
Ġl n
Ġk r
Ġk k
Ġa c
Ġn p
Ġd a
Ġp n
Ġb p
Ġz t
Ġi l
Ġz c
Ġp a
Ġo n
Ġk z
Ġb z
Ġl d
Ġg f
Ġw j
Ġu a
Ġb m
Ġb q
Ġv y
Ġo t
Ġb i
Ġq o
Ġk d
Ġm b
Ġm g
Ġu o
Ġp y
Ġq z
Ġn r
Ġq n
Ġs u
Ġn d
Ġt r
Ġx v
Ġf b
Ġy f
Ġp i
Ġr o
Ġs j
Ġh v
Ġo b
Ġe h
Ġl g
Ġr f
Ġs q
Ġn g
Ġk y
Ġr z
Ġv o
Ġs z
Ġx h
Ġw i
Ġd g
Ġb n
Ġd r
Ġa k
Ġl f
Ġu u
Ġy e
Ġe t
Ġy q
Ġs l
Ġd o
Ġk q
Ġf l
Ġs v
Ġq w
Ġa z
Ġw o
Ġb h
Ġr b
Ġp m
