{"[PAD]":0,"[UNK]":1,"[EOS]":2,"[SOS]":3,"!":4,"\"":5,"#":6,"$":7,"%":8,"&":9,"'":10,"(":11,")":12,"*":13,"+":14,",":15,"-":16,".":17,"/":18,"0":19,"1":20,"2":21,"3":22,"4":23,"5":24,"6":25,"7":26,"8":27,"9":28,":":29,";":30,"<":31,"=":32,">":33,"?":34,"@":35,"A":36,"B":37,"C":38,"D":39,"E":40,"F":41,"G":42,"H":43,"I":44,"J":45,"K":46,"L":47,"M":48,"N":49,"O":50,"P":51,"Q":52,"R":53,"S":54,"T":55,"U":56,"V":57,"W":58,"X":59,"Y":60,"Z":61,"[":62,"\\":63,"]":64,"^":65,"_":66,"`":67,"a":68,"b":69,"c":70,"d":71,"e":72,"f":73,"g":74,"h":75,"i":76,"j":77,"k":78,"l":79,"m":80,"n":81,"o":82,"p":83,"q":84,"r":85,"s":86,"t":87,"u":88,"v":89,"w":90,"x":91,"y":92,"z":93,"{":94,"|":95,"}":96,"~":97,"¡":98,"¢":99,"£":100,"¤":101,"¥":102,"¦":103,"§":104,"¨":105,"©":106,"ª":107,"«":108,"¬":109,"®":110,"¯":111,"°":112,"±":113,"²":114,"³":115,"´":116,"µ":117,"¶":118,"·":119,"¸":120,"¹":121,"º":122,"»":123,"¼":124,"½":125,"¾":126,"¿":127,"À":128,"Á":129,"Â":130,"Ã":131,"Ä":132,"Å":133,"Æ":134,"Ç":135,"È":136,"É":137,"Ê":138,"Ë":139,"Ì":140,"Í":141,"Î":142,"Ï":143,"Ð":144,"Ñ":145,"Ò":146,"Ó":147,"Ô":148,"Õ":149,"Ö":150,"×":151,"Ø":152,"Ù":153,"Ú":154,"Û":155,"Ü":156,"Ý":157,"Þ":158,"ß":159,"à":160,"á":161,"â":162,"ã":163,"ä":164,"å":165,"æ":166,"ç":167,"è":168,"é":169,"ê":170,"ë":171,"ì":172,"í":173,"î":174,"ï":175,"ð":176,"ñ":177,"ò":178,"ó":179,"ô":180,"õ":181,"ö":182,"÷":183,"ø":184,"ù":185,"ú":186,"û":187,"ü":188,"ý":189,"þ":190,"ÿ":191,"Ā":192,"ā":193,"Ă":194,"ă":195,"Ą":196,"ą":197,"Ć":198,"ć":199,"Ĉ":200,"ĉ":201,"Ċ":202,"ċ":203,"Č":204,"č":205,"Ď":206,"ď":207,"Đ":208,"đ":209,"Ē":210,"ē":211,"Ĕ":212,"ĕ":213,"Ė":214,"ė":215,"Ę":216,"ę":217,"Ě":218,"ě":219,"Ĝ":220,"ĝ":221,"Ğ":222,"ğ":223,"Ġ":224,"ġ":225,"Ģ":226,"ģ":227,"Ĥ":228,"ĥ":229,"Ħ":230,"ħ":231,"Ĩ":232,"ĩ":233,"Ī":234,"ī":235,"Ĭ":236,"ĭ":237,"Į":238,"į":239,"İ":240,"ı":241,"Ĳ":242,"ĳ":243,"Ĵ":244,"ĵ":245,"Ķ":246,"ķ":247,"ĸ":248,"Ĺ":249,"ĺ":250,"Ļ":251,"ļ":252,"Ľ":253,"ľ":254,"Ŀ":255,"ŀ":256,"Ł":257,"ł":258,"Ń":259,"TH":260,"ST":261,"ĠS":262,"ĠE":263,"NO":264,"RTH":265,"ĠNO":266,"ĠNORTH":267,"EST":268,"WEST":269,"ĠWEST":270,"OU":271,"ĠSOU":272,"ĠSOUTH":273,"AST":274,"ĠEAST":275,"Ġi":276,"Ġj":277,"Ġf":278,"Ġt":279,"Ġv":280,"Ġk":281,"Ġl":282,"Ġo":283,"Ġq":284,"Ġh":285,"Ġr":286,"Ġg":287,"Ġx":288,"Ġn":289,"Ġu":290,"Ġy":291,"Ġz":292,"Ġc":293,"Ġa":294,"Ġm":295,"Ġe":296,"Ġp":297,"Ġw":298,"Ġd":299,"Ġb":300,"Ġs":301,"AR":302,"ATH":303,"DE":304,"MO":305,"PATH":306,"or":307,"ĠST":308,"ĠPATH":309,"ART":310,"MODE":311,"ĠSTART":312,"For":313,"ND":314,"ag":315,"es":316,"hor":317,"in":318,"tes":319,"ĠFor":320,"ĠShor":321,"ĠEND":322,"agin":323,"test":324,"ĠForagin":325,"ĠShortest":326,"ĠForaging":327,"Ġar":328,"Ġlu":329,"Ġfe":330,"Ġrr":331,"Ġqy":332,"Ġim":333,"Ġlp":334,"Ġjg":335,"Ġmo":336,"Ġxs":337,"Ġpb":338,"Ġkp":339,"Ġqe":340,"Ġze":341,"Ġhm":342,"Ġfg":343,"Ġnw":344,"Ġwv":345,"Ġee":346,"Ġmc":347,"Ġkv":348,"Ġsx":349,"Ġfk":350,"Ġhx":351,"Ġpk":352,"Ġoa":353,"Ġwx":354,"Ġyu":355,"Ġnb":356,"Ġsh":357,"Ġri":358,"Ġnm":359,"Ġjp":360,"Ġtq":361,"Ġdl":362,"Ġjj":363,"Ġiu":364,"Ġbs":365,"Ġcz":366,"Ġrk":367,"Ġvj":368,"Ġod":369,"Ġwm":370,"Ġgb":371,"Ġnu":372,"Ġdj":373,"Ġkb":374,"Ġey":375,"Ġpc":376,"Ġqd":377,"Ġyn":378,"Ġcl":379,"Ġlo":380,"Ġry":381,"Ġtf":382,"Ġlz":383,"Ġxw":384,"Ġne":385,"Ġbt":386,"Ġiv":387,"Ġgc":388,"Ġzl":389,"Ġui":390,"Ġkf":391,"Ġir":392,"Ġra":393,"Ġzs":394,"Ġdh":395,"Ġao":396,"Ġuf":397,"Ġzm":398,"Ġct":399,"Ġfu":400,"Ġva":401,"Ġnt":402,"Ġia":403,"Ġtc":404,"Ġjf":405,"Ġyh":406,"Ġjb":407,"Ġks":408,"Ġfp":409,"Ġom":410,"Ġun":411,"Ġlt":412,"Ġqs":413,"Ġvc":414,"Ġjn":415,"Ġxb":416,"Ġoe":417,"Ġta":418,"Ġxu":419,"Ġhz":420,"Ġdw":421,"Ġyv":422,"Ġkh":423,"Ġop":424,"Ġvf":425,"Ġcr":426,"Ġrt":427,"Ġvm":428,"Ġgo":429,"Ġae":430,"Ġdk":431,"Ġrp":432,"Ġjv":433,"Ġzx":434,"Ġuw":435,"Ġoz":436,"Ġtg":437,"Ġha":438,"Ġqc":439,"Ġjh":440,"Ġbk":441,"Ġzp":442,"Ġft":443,"Ġcs":444,"Ġka":445,"Ġvt":446,"Ġiw":447,"Ġqm":448,"Ġug":449,"Ġkm":450,"Ġbb":451,"Ġsg":452,"Ġzj":453,"Ġef":454,"Ġrh":455,"Ġqh":456,"Ġyp":457,"Ġbl":458,"Ġig":459,"Ġqt":460,"Ġip":461,"Ġma":462,"Ġdm":463,"Ġog":464,"Ġwf":465,"Ġiz":466,"Ġab":467,"Ġii":468,"Ġvn":469,"Ġow":470,"Ġoq":471,"Ġvq":472,"Ġwu":473,"Ġlb":474,"Ġpp":475,"Ġjk":476,"Ġts":477,"Ġvd":478,"Ġhk":479,"Ġlv":480,"Ġfd":481,"Ġuz":482,"Ġbu":483,"Ġxj":484,"Ġew":485,"Ġre":486,"Ġwz":487,"Ġck":488,"Ġxa":489,"Ġnz":490,"Ġut":491,"Ġei":492,"Ġth":493,"Ġle":494,"Ġlx":495,"Ġko":496,"Ġgd":497,"Ġmv":498,"Ġdq":499,"Ġgt":500,"Ġba":501,"Ġjt":502,"Ġwl":503,"Ġfh":504,"Ġca":505,"Ġyo":506,"Ġkn":507,"Ġzi":508,"Ġtn":509,"Ġgn":510,"Ġrg":511,"Ġpv":512,"Ġyx":513,"Ġfw":514,"Ġfx":515,"Ġiy":516,"Ġos":517,"Ġis":518,"Ġtx":519,"Ġni":520,"Ġjr":521,"Ġdu":522,"Ġah":523,"Ġph":524,"Ġjw":525,"Ġkc":526,"Ġgu":527,"Ġqv":528,"Ġql":529,"Ġme":530,"Ġnv":531,"Ġus":532,"Ġhn":533,"Ġas":534,"Ġpz":535,"Ġin":536,"Ġgj":537,"Ġvr":538,"Ġxf":539,"Ġvu":540,"Ġbo":541,"Ġzz":542,"Ġkx":543,"Ġer":544,"Ġuj":545,"Ġkg":546,"Ġml":547,"Ġat":548,"Ġhb":549,"Ġxm":550,"Ġqj":551,"Ġsd":552,"Ġes":553,"Ġsr":554,"Ġhj":555,"Ġsa":556,"Ġaa":557,"Ġtj":558,"Ġvl":559,"Ġlc":560,"Ġkt":561,"Ġzk":562,"Ġll":563,"Ġns":564,"Ġmk":565,"Ġub":566,"Ġax":567,"Ġqa":568,"Ġso":569,"Ġgw":570,"Ġqi":571,"Ġyi":572,"Ġeb":573,"Ġxt":574,"Ġlq":575,"Ġtv":576,"Ġdz":577,"Ġzq":578,"Ġud":579,"Ġeu":580,"Ġlr":581,"Ġhw":582,"Ġwa":583,"Ġte":584,"Ġvs":585,"Ġam":586,"Ġbr":587,"Ġbv":588,"Ġyr":589,"Ġrl":590,"Ġue":591,"Ġjy":592,"Ġof":593,"Ġyb":594,"Ġdx":595,"Ġhg":596,"Ġih":597,"Ġgg":598,"Ġmt":599,"Ġfr":600,"Ġtd":601,"Ġwk":602,"Ġxk":603,"Ġit":604,"Ġwb":605,"Ġib":606,"Ġad":607,"Ġms":608,"Ġcj":609,"Ġrw":610,"Ġdf":611,"Ġnj":612,"Ġps":613,"Ġoh":614,"Ġgi":615,"Ġsp":616,"Ġtk":617,"Ġok":618,"Ġvg":619,"Ġfv":620,"Ġjq":621,"Ġvz":622,"Ġmw":623,"Ġch":624,"Ġsk":625,"Ġfy":626,"Ġpl":627,"Ġid":628,"Ġyc":629,"Ġmn":630,"Ġhe":631,"Ġys":632,"Ġhr":633,"Ġgh":634,"Ġul":635,"Ġsf":636,"Ġxz":637,"Ġej":638,"Ġtu":639,"Ġwy":640,"Ġyw":641,"Ġuh":642,"Ġqk":643,"Ġhq":644,"Ġpr":645,"Ġwd":646,"Ġss":647,"Ġpq":648,"Ġtw":649,"Ġgm":650,"Ġpu":651,"Ġgp":652,"Ġio":653,"Ġmh":654,"Ġfa":655,"Ġif":656,"Ġga":657,"Ġst":658,"Ġmu":659,"Ġbd":660,"Ġrs":661,"Ġci":662,"Ġfz":663,"Ġto":664,"Ġfc":665,"Ġum":666,"Ġcx":667,"Ġeg":668,"Ġev":669,"Ġap":670,"Ġcc":671,"Ġdd":672,"Ġtz":673,"Ġrn":674,"Ġik":675,"Ġzw":676,"Ġyg":677,"Ġxp":678,"Ġhu":679,"Ġov":680,"Ġvw":681,"Ġfm":682,"Ġbe":683,"Ġyy":684,"Ġvh":685,"Ġvi":686,"Ġyz":687,"Ġxd":688,"Ġki":689,"Ġve":690,"Ġxq":691,"Ġfn":692,"Ġkj":693,"Ġnn":694,"Ġff":695,"Ġoy":696,"Ġwq":697,"Ġla":698,"Ġsb":699,"Ġxc":700,"Ġrx":701,"Ġzh":702,"Ġtt":703,"Ġza":704,"Ġgq":705,"Ġgr":706,"Ġhf":707,"Ġzb":708,"Ġxr":709,"Ġix":710,"Ġhp":711,"Ġvk":712,"Ġbc":713,"Ġke":714,"Ġli":715,"Ġqu":716,"Ġtl":717,"Ġtm":718,"Ġfs":719,"Ġyd":720,"Ġjc":721,"Ġnc":722,"Ġsi":723,"Ġdc":724,"Ġpx":725,"Ġhy":726,"Ġcg":727,"Ġgv":728,"Ġpg":729,"Ġxe":730,"Ġsy":731,"Ġws":732,"Ġjd":733,"Ġdy":734,"Ġgx":735,"Ġse":736,"Ġgl":737,"Ġqf":738,"Ġvx":739,"Ġby":740,"Ġpo":741,"Ġco":742,"Ġag":743,"Ġym":744,"Ġoj":745,"Ġbg":746,"Ġek":747,"Ġsn":748,"Ġgk":749,"Ġyl":750,"Ġbx":751,"Ġji":752,"Ġku":753,"Ġmm":754,"Ġcv":755,"Ġno":756,"Ġup":757,"Ġgz":758,"Ġox":759,"Ġmd":760,"Ġds":761,"Ġoo":762,"Ġan":763,"Ġcu":764,"Ġcy":765,"Ġed":766,"Ġho":767,"Ġmz":768,"Ġje":769,"Ġpw":770,"Ġkl":771,"Ġic":772,"Ġcq":773,"Ġpe":774,"Ġiq":775,"Ġur":776,"Ġay":777,"Ġol":778,"Ġde":779,"Ġmr":780,"Ġoi":781,"Ġtb":782,"Ġzf":783,"Ġlm":784,"Ġju":785,"Ġfi":786,"Ġhc":787,"Ġez":788,"Ġaw":789,"Ġxx":790,"Ġal":791,"Ġem":792,"Ġlh":793,"Ġgy":794,"Ġdp":795,"Ġcm":796,"Ġly":797,"Ġpf":798,"Ġie":799,"Ġnq":800,"Ġxg":801,"Ġec":802,"Ġpd":803,"Ġwg":804,"Ġqb":805,"Ġjm":806,"Ġfq":807,"Ġfo":808,"Ġuq":809,"Ġcw":810,"Ġqg":811,"Ġhh":812,"Ġaq":813,"Ġkw":814,"Ġhs":815,"Ġxo":816,"Ġmp":817,"Ġpt":818,"Ġen":819,"Ġel":820,"Ġzv":821,"Ġcb":822,"Ġww":823,"Ġxy":824,"Ġge":825,"Ġeo":826,"Ġwr":827,"Ġuy":828,"Ġce":829,"Ġfj":830,"Ġnh":831,"Ġeq":832,"Ġny":833,"Ġyk":834,"Ġhd":835,"Ġqp":836,"Ġrj":837,"Ġzr":838,"Ġjx":839,"Ġyj":840,"Ġai":841,"Ġuc":842,"Ġwn":843,"Ġrc":844,"Ġsc":845,"Ġmy":846,"Ġwt":847,"Ġvp":848,"Ġjz":849,"Ġpj":850,"Ġaf":851,"Ġru":852,"Ġty":853,"Ġxn":854,"Ġtp":855,"Ġex":856,"Ġlk":857,"Ġdb":858,"Ġvb":859,"Ġrv":860,"Ġxi":861,"Ġij":862,"Ġzn":863,"Ġnx":864,"Ġea":865,"Ġep":866,"Ġjo":867,"Ġnk":868,"Ġdt":869,"Ġzy":870,"Ġsw":871,"Ġna":872,"Ġdv":873,"Ġnl":874,"Ġxl":875,"Ġrq":876,"Ġau":877,"Ġaj":878,"Ġsm":879,"Ġbj":880,"Ġoc":881,"Ġmf":882,"Ġht":883,"Ġmi":884,"Ġwc":885,"Ġdi":886,"Ġmx":887,"Ġja":888,"Ġhi":889,"Ġqr":890,"Ġjl":891,"Ġya":892,"Ġzu":893,"Ġuk":894,"Ġzg":895,"Ġuv":896,"Ġlj":897,"Ġwe":898,"Ġlw":899,"Ġcp":900,"Ġav":901,"Ġrm":902,"Ġou":903,"Ġux":904,"Ġnf":905,"Ġmq":906,"Ġbw":907,"Ġmj":908,"Ġls":909,"Ġrd":910,"Ġyt":911,"Ġcd":912,"Ġor":913,"Ġbf":914,"Ġti":915,"Ġqq":916,"Ġwp":917,"Ġhl":918,"Ġzo":919,"Ġwh":920,"Ġvv":921,"Ġjs":922,"Ġqx":923,"Ġcn":924,"Ġln":925,"Ġkr":926,"Ġkk":927,"Ġac":928,"Ġnp":929,"Ġda":930,"Ġpn":931,"Ġbp":932,"Ġzt":933,"Ġil":934,"Ġzc":935,"Ġpa":936,"Ġon":937,"Ġkz":938,"Ġbz":939,"Ġld":940,"Ġgf":941,"Ġwj":942,"Ġua":943,"Ġbm":944,"Ġbq":945,"Ġvy":946,"Ġot":947,"Ġbi":948,"Ġqo":949,"Ġkd":950,"Ġmb":951,"Ġmg":952,"Ġuo":953,"Ġpy":954,"Ġqz":955,"Ġnr":956,"Ġqn":957,"Ġsu":958,"Ġnd":959,"Ġtr":960,"Ġxv":961,"Ġfb":962,"Ġyf":963,"Ġpi":964,"Ġro":965,"Ġsj":966,"Ġhv":967,"Ġob":968,"Ġeh":969,"Ġlg":970,"Ġrf":971,"Ġsq":972,"Ġng":973,"Ġky":974,"Ġrz":975,"Ġvo":976,"Ġsz":977,"Ġxh":978,"Ġwi":979,"Ġdg":980,"Ġbn":981,"Ġdr":982,"Ġak":983,"Ġlf":984,"Ġuu":985,"Ġye":986,"Ġet":987,"Ġyq":988,"Ġsl":989,"Ġdo":990,"Ġkq":991,"Ġfl":992,"Ġsv":993,"Ġqw":994,"Ġaz":995,"Ġwo":996,"Ġbh":997,"Ġrb":998,"Ġpm":999}